RIET/src/Documents/ПроводкаDSS/ПроводкаDSS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроводкаDSS</name>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
  <registerRecords>AccumulationRegister.ПроводкиDSS_SB</registerRecords>
  <registerRecords>AccumulationRegister.ПроводкиDSS_FA</registerRecords>
  <registerRecords>AccumulationRegister.НДСНачисленныйLawson</registerRecords>
  <registerRecords>AccumulationRegister.МатериальныеАктивы</registerRecords>
  <attributes>
    <name>System</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.InventoryСписание</types>
      <types>DocumentRef.ПроводкаDSS</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.InventoryПоступление</types>
      <types>DocumentRef.СчетКнигиПокупок</types>
      <types>DocumentRef.ПодготовкаКПередачеОС</types>
      <types>DocumentRef.InventoryКорректировка</types>
      <types>DocumentRef.InventoryПеремещение</types>
      <types>DocumentRef.ОперацияLawson</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОплатаКнигиПокупок</types>
      <types>DocumentRef.ОтчетПринципалуОПродажах</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.НачислениеАмортизации</types>
    </type>
  </attributes>
  <attributes>
    <name>GeoMarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <attributes>
    <name>Модуль</name>
    <type>
      <types>EnumRef.МодулиРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FiscalType</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountLawson</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>BaseAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TranAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>GUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PeriodLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UpdateDateLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SeqTrnsNbrLawson</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OrigCompanyLawson</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Activity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>JeTypeLawson</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>JournalLawson</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LineNbrLawson</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AutoRevLawson</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Operator</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LegalFiscalFlagLawson</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VendorVname</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ApInvoice</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransNbr</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OrigOperatorId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CashCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PoNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LineNbrIc</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PoCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AssetLawson</name>
    <type>
      <types>CatalogRef.ОсновныеСредстваLawson</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomerNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomerName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ArInvoice</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentNbr</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AktOfAcceptance</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AktDateLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ApTransFormId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентLawson</name>
    <type>
      <types>CatalogRef.КонтрагентыLawson</types>
    </type>
  </attributes>
  <attributes>
    <name>Deferred</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>POLine</name>
    <type>
      <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>RubAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FiscAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TempDiff</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PermDiff</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExchDiff</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроводки</name>
    <type>
      <types>EnumRef.ТипыПроводокAPAP</types>
    </type>
  </attributes>
  <attributes>
    <name>Ваучер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FiscalDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceLine</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </attributes>
  <attributes>
    <name>Urn</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/AccumulationRegisters/ПроводкиDSS_FA/ПроводкиDSS_FA.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПроводкиDSS_FA</name>
  <resources>
    <name>BaseAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>GltObjID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Asset</name>
    <type>
      <types>CatalogRef.ОсновныеСредстваLawson</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/AccumulationRegisters/МатериальныеАктивы/МатериальныеАктивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МатериальныеАктивы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПроводкаДеталейСКП</name>
    <type>
      <types>DocumentRef.ПроводкаDSS</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/ПроводкаDSS/ManagerModule.bsl
Процедура ВыполнитьДвижениеПоРегиструПроводкиDSSОбщие(ДанныеДляПроводки) Экспорт
	
	ДвиженияОбщие = РегистрыНакопления.ПроводкиDSSОбщие.СоздатьНаборЗаписей();
	ДвиженияОбщие.Отбор.Регистратор.Установить(ДанныеДляПроводки.Регистратор);
	ДвиженияОбщие.Записывать = Истина;
	
	Строка = ДвиженияОбщие.Добавить();
	
	Строка.Период = ДанныеДляПроводки.Период;	
	Строка.AccountLawson = ДанныеДляПроводки.AccountLawson ;
	Строка.FiscalType = ДанныеДляПроводки.FiscalType;
	Строка.AU = ДанныеДляПроводки.AU; 
	Строка.LegalEntity = ДанныеДляПроводки.LegalEntity;      
	Строка.BaseAmount = ДанныеДляПроводки.BaseAmount;
	Строка.System = ДанныеДляПроводки.System;
	Строка.GltObjId = ДанныеДляПроводки.GltObjId; 
	Строка.DateLawson = ДанныеДляПроводки.DateLawson; 
	Строка.Reference = ДанныеДляПроводки.Reference;
	Строка.Description = ДанныеДляПроводки.Description;
	Строка.TranAmount = ДанныеДляПроводки.TranAmount; 
	Строка.Currency = ДанныеДляПроводки.Currency;
	Строка.GUID =  ДанныеДляПроводки.GUID;
	Строка.PeriodLawson = ДанныеДляПроводки.PeriodLawson;
	Строка.Company = ДанныеДляПроводки.Company;
	Строка.Модуль = ДанныеДляПроводки.Модуль;  
	Строка.RubAmount = ДанныеДляПроводки.RubAmount;
	Строка.FiscAmount = ДанныеДляПроводки.FiscAmount;
	Строка.TempDiff = ДанныеДляПроводки.TempDiff;
	Строка.PermDiff = ДанныеДляПроводки.PermDiff;
	Строка.ExchDiff = ДанныеДляПроводки.ExchDiff;  
	
	ДвиженияОбщие.Записать();    	
	
КонецПроцедуры

Процедура ВыполнитьДвижениеПоРегиструПроводкиDSSSB(ДанныеДляПроводки,LawsonInvoice) Экспорт  
	
	ДвиженияSB = РегистрыНакопления.ПроводкиDSS_SB.СоздатьНаборЗаписей();
	ДвиженияSB.Отбор.Регистратор.Установить(ДанныеДляПроводки.Регистратор);
	ДвиженияSB.Записывать = Истина;
	
	Строка = ДвиженияSB.Добавить();
	
	Строка.Период = ДанныеДляПроводки.Период;	
	Строка.Type = ДанныеДляПроводки.FiscalType;	
	Строка.ArInvoice = LawsonInvoice;
	Строка.CustomerNumber = ДанныеДляПроводки.КонтрагентLawson;
	Строка.AccountUnit = ДанныеДляПроводки.AU; 
	Строка.Account = ДанныеДляПроводки.AccountLawson; 
	Строка.CurrencyCode = ДанныеДляПроводки.Currency;
	Строка.FiscalYear = НачалоГода(ДанныеДляПроводки.Период); 
	Строка.TranAmount = ДанныеДляПроводки.TranAmount; 
	Строка.BaseAmount = ДанныеДляПроводки.BaseAmount; 
	Строка.Mgmtctry  = ДанныеДляПроводки.GeoMarket.Код;                			
	Строка.Company = ДанныеДляПроводки.Company;
	Строка.Location = ДанныеДляПроводки.AU.ПодразделениеОрганизации; 				
	Строка.MgmtNIS = ДанныеДляПроводки.AccountLawson.Родитель.Родитель.Код; 				
	Строка.SummaryAcct = ДанныеДляПроводки.AccountLawson.Родитель.Код; 
	Строка.SummaryAcctDesc = ДанныеДляПроводки.AccountLawson.Родитель.Наименование;
	//Строка.SubAccount = ; //не заполняем
	Строка.AccountingPeriod = Месяц(ДанныеДляПроводки.Период);
	Строка.Activity = ДанныеДляПроводки.Activity;
	Строка.SourceCode = ДанныеДляПроводки.SourceCode;
	Строка.System = ДанныеДляПроводки.System;
	Строка.Reference = ДанныеДляПроводки.Reference;
	Строка.Description = ДанныеДляПроводки.Description;
	Строка.CustomerName = ДанныеДляПроводки.CustomerName;
	Строка.GltObjId = ДанныеДляПроводки.GltObjId;     
	
	ДвиженияSB.Записать();	
	
КонецПроцедуры

Процедура ВыполнитьДвижениеПоРегиструПроводкиDSSFA(ДанныеДляПроводки) Экспорт
	
	Если НЕ ДанныеДляПроводки.System = "AM" Тогда
		Возврат;	
	КонецЕсли; 
	
	// Справка по условию	
	//"AMDEADJ" //DEPRECIATION ADJUSTMENT (Кт 02)
	//"AMDEDIS" //DEPRECIATION DISPOSAL   (Дт 02)
	//"AMDEPR"  //DEPRECIATION            (Кт 02)
	//"AMDETRF" //DEPRECIATION TRANSFER   (Кт 02)
	//"AMFAADD" //ASSETS ADDITION         (Дт 01)
	//"AMFAADJ" //ASSETS ADJUSTMENT       (Дт 01)
	//"AMFADIS" //ASSETS DISPOSAL         (Кт 01)
	//"AMFATRF" //ASSETS TRANSFER         (Дт 01)   
	Код = СокрЛП(ДанныеДляПроводки.FiscalType.Код);
	Если НЕ (Код = "AMDEADJ" 
		ИЛИ Код = "AMDEDIS" 
		ИЛИ Код = "AMDEPR" 
		ИЛИ Код = "AMDETRF" 
		ИЛИ Код = "AMFAADD" 
		ИЛИ Код = "AMFAADJ" 
		ИЛИ Код = "AMFADIS" 
		ИЛИ Код = "AMFATRF") Тогда  		
		Возврат;		
	КонецЕсли;  		
	
	ДвиженияFA = РегистрыНакопления.ПроводкиDSS_FA.СоздатьНаборЗаписей();
	ДвиженияFA.Отбор.Регистратор.Установить(ДанныеДляПроводки.Регистратор);
	ДвиженияFA.Записывать = Истина;   	
	
	Строка = ДвиженияFA.Добавить();
	Строка.Asset = ДанныеДляПроводки.AssetLawson;
	Строка.AU =  ДанныеДляПроводки.AU;
	Строка.Account = ДанныеДляПроводки.AccountLawson;
	Строка.BaseAmount =  ДанныеДляПроводки.BaseAmount;
	Строка.GltObjId =  ДанныеДляПроводки.GltObjId;
	Строка.Description = ДанныеДляПроводки.Description;
	Строка.Type = ДанныеДляПроводки.FiscalType;	
	Строка.Период = ДанныеДляПроводки.Период;
	
	Если Код = "AMDEADJ"    //DEPRECIATION ADJUSTMENT
		ИЛИ Код = "AMDEPR"  //DEPRECIATION 
		ИЛИ Код = "AMDETRF" //DEPRECIATION TRANSFER  
		ИЛИ Код = "AMFAADD" //ASSETS ADDITION  
		ИЛИ Код = "AMFAADJ" //ASSETS ADJUSTMENT 
		ИЛИ Код = "AMFATRF" //ASSETS TRANSFER 
		Тогда
		Строка.ВидДвижения = ВидДвиженияНакопления.Приход;
	Иначе	
		Строка.ВидДвижения = ВидДвиженияНакопления.Расход;
		Строка.BaseAmount = - Строка.BaseAmount;
	КонецЕсли;     
	
	ДвиженияFA.Записать(); 
	
КонецПроцедуры

Процедура ВыполнитьДвижениеПоРегиструПоРегиструМатериальныеАктивы(ДанныеДляПроводки) Экспорт
	
	Код = СокрЛП(ДанныеДляПроводки.FiscalType.Код);
	Если НЕ (Код = "AP##FAFM" 
		ИЛИ Код = "APD3PFAFM" 
		ИЛИ Код = "APDIRFAFM" 
		ИЛИ Код = "FA cost") Тогда  		
		Возврат;		
	КонецЕсли;  	
	
	Запрос = Новый Запрос;    		
	Запрос.УстановитьПараметр("Ссылка", ДанныеДляПроводки.Регистратор);
	Запрос.УстановитьПараметр("ВалютаРуб", Справочники.Валюты.НайтиПоКоду("643"));
	Запрос.УстановитьПараметр("Валюта", Справочники.Валюты.НайтиПоКоду("840"));
	Запрос.УстановитьПараметр("AccountLawsonRNI", ПланыСчетов.Lawson.НайтиПоКоду("201900"));
	Запрос.УстановитьПараметр("AccountLawsonINR", ПланыСчетов.Lawson.НайтиПоКоду("130508"));
	Запрос.УстановитьПараметр("Период", ДанныеДляПроводки.PeriodLawson); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПроводкаDSS.Ссылка КАК ПроводкаДеталейСКП,
	               |	ПроводкаDSS.BaseAmount КАК Сумма,
	               |	ВЫБОР
	               |		КОГДА ПроводкаDSS.Ссылка.Currency = &ВалютаРуб
	               |			ТОГДА ПроводкаDSS.Ссылка.TranAmount
	               |		ИНАЧЕ ПроводкаDSS.Ссылка.BaseAmount * ЕСТЬNULL(КурсыВалют.Курс, 0)
	               |	КОНЕЦ КАК СуммаРуб,
	               |	ПроводкаDSS.Ссылка.Дата КАК Период,
	               |	ВЫБОР
	               |		КОГДА ПроводкаDSS.Ссылка.AccountLawson = &AccountLawsonRNI
	               |			ТОГДА ""RNI""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПроводкаDSS.Ссылка.AccountLawson = &AccountLawsonINR
	               |					ТОГДА ""INR""
	               |				ИНАЧЕ ВЫРАЗИТЬ("""" КАК СТРОКА(15))
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Тип,
	               |	ПроводкаDSS.PoNumber,
	               |	ПроводкаDSS.POLine.Ссылка КАК POLine,
	               |	ПроводкаDSS.POLine.Количество КАК Количество
	               |ИЗ
	               |	Документ.ПроводкаDSS КАК ПроводкаDSS
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	               |		ПО ПроводкаDSS.PeriodLawson = КурсыВалют.Период
	               |ГДЕ
	               |	КурсыВалют.Валюта = &Валюта
	               |	И КурсыВалют.Период = &Период
	               |	И ПроводкаDSS.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаспределениеМатериаловИзКнигиПокупокINVENTORY.Ссылка КАК ДокРаспределениеМА,
	               |	ПроводкаDSS.Ссылка КАК ПроводкаСКП
	               |ИЗ
	               |	Документ.ПроводкаDSS КАК ПроводкаDSS
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеМатериаловИзКнигиПокупок.INVENTORY КАК РаспределениеМатериаловИзКнигиПокупокINVENTORY
	               |		ПО ПроводкаDSS.Ссылка = РаспределениеМатериаловИзКнигиПокупокINVENTORY.ПроводкаДеталейСКП
	               |			И ((НЕ РаспределениеМатериаловИзКнигиПокупокINVENTORY.Ссылка.ПометкаУдаления))
	               |ГДЕ
	               |	ПроводкаDSS.Ссылка.Модуль = ЗНАЧЕНИЕ(Перечисление.МодулиРазработки.InventoryCosts)
	               |	И РаспределениеМатериаловИзКнигиПокупокINVENTORY.Ссылка ЕСТЬ NULL 
	               |	И ПроводкаDSS.Ссылка = &Ссылка";

				   
	Результат = Запрос.ВыполнитьПакет();
	РезультатДляМА = Результат[0].Выгрузить();
		
	ДвиженияМА = РегистрыНакопления.МатериальныеАктивы.СоздатьНаборЗаписей();
	ДвиженияМА.Отбор.Регистратор.Установить(ДанныеДляПроводки.Регистратор);
	ДвиженияМА.Записывать = Истина;
	
	Для Каждого СтрокаТЗПроводок Из РезультатДляМА цикл
		Движение = ДвиженияМА.ДобавитьПриход();
		Движение.ПроводкаДеталейСКП = СтрокаТЗПроводок.ПроводкаДеталейСКП;
		Движение.Период = СтрокаТЗПроводок.Период;
		Движение.Сумма = СтрокаТЗПроводок.Сумма;
		Движение.СуммаРуб = СтрокаТЗПроводок.СуммаРуб;
	КонецЦикла;
	ДвиженияМА.Записать();
	//Документ  Распределение МА
	Выборка = Результат[1].Выбрать();
	// проверяем наличие документа для проводки AP, если нет - создаем
	Если Выборка.Следующий() Тогда 
		ДокРаспределениеМА = Документы.РаспределениеМатериаловИзКнигиПокупок.СоздатьДокумент();
		ДокРаспределениеМА.Дата = ДанныеДляПроводки.Период;
		Выборка.Сбросить();
		Пока Выборка.Следующий() цикл 
			ДанныеНовойСтроки = РезультатДляМА.Найти(Выборка.ПроводкаСКП, "ПроводкаДеталейСКП");
			НоваяСтрока = ДокРаспределениеМА.INVENTORY.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ДанныеНовойСтроки);
		КонецЦикла;
		//НачатьТранзакцию(РежимУправленияБлокировкойДанных.Автоматический);
			InventoryСервер.ЗаписатьДокументВВыбранномРежиме(ДокРаспределениеМА, РежимЗаписиДокумента.Проведение);
		//ЗафиксироватьТранзакцию();
	КонецЕсли;
             	
КонецПроцедуры
